<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b92fbca1bfbb733e6541df4756bd35eaba95d2e0cf3daf8cd8c7076b88de3360","plan_job_ref":"Job Terraform Plan #567 at https://github.com/cal-itp/data-infra/actions/runs/18207450105","plan_out_hash":"3d3e1d580a6b4a559844d9a8bb96587a2dc0a42926f3c1dd448ab7f4b83c1d5f","plan_hash":"f4a3be61c4734a8cb22a35ad83205b9dd8e62a61f500e343fc135b269e6f3133","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/sentinel/us__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_logging_organization_sink.sentinel-organization-sink[0] will be created
+   resource "google_logging_organization_sink" "sentinel-organization-sink" {
+       destination        = "pubsub.googleapis.com/projects/cal-itp-data-infra/topics/sentinel-topic"
+       filter             = "protoPayload.serviceName=iam.googleapis.com"
+       id                 = (known after apply)
+       include_children   = true
+       intercept_children = false
+       name               = "IAM-logs-organization-sentinel-sink"
+       org_id             = "************"
+       writer_identity    = (known after apply)

+       bigquery_options (known after apply)
    }

  # google_project_iam_binding.log-writer-organization[0] will be created
+   resource "google_project_iam_binding" "log-writer-organization" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       members = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/pubsub.publisher"
    }

  # google_pubsub_subscription.sentinel-subscription will be created
+   resource "google_pubsub_subscription" "sentinel-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "sentinel-subscription-IAMlogs"
+       project                    = "cal-itp-data-infra"
+       terraform_labels           = {
+           "goog-terraform-provisioned" = "true"
        }
+       topic                      = "sentinel-topic"

+       expiration_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #567](https://github.com/cal-itp/data-infra/actions/runs/18207450105)